package T15_HashMao_linfedHashMap_TreeMap_Множкствв.Task4;

import java.util.HashMap;
import java.util.Map;

public class Minain {
    public static void main(String[] args) {
        Map<String, Integer> food = new HashMap<>();

        // Добавим продукты:
        food.put("Яблоки", 52);
        food.put("Авокадо", 160);
        food.put("Молоко", 50);
        food.put("Сыр", 357);
        food.put("Пицца", 275);
        food.put("Персик", 98);
        food.put("Йогурт", 92);
        food.put("Орехи макадамия", 718);
        food.put("Vollmilchschokolade", 512);
        food.put("فطيرة", 230);

        // Выведем содержимое в консоль:
        System.out.println("Содержимое холодильника: " + food + ".");


        // Проверим, что все любимые продукты на месте:
        boolean hasApples = food.containsKey("Яблоки");
        System.out.println("А у нас есть яблоки? 🤔 Ответ: " + hasApples + " 🥳.");

        boolean hasYogurt = food.containsKey("Йогурт");
        System.out.println("А у нас есть йогурт? 🤔 Ответ: " + hasYogurt + " 🥳.");
        System.out.println("Мы вылили йогурт :(");
        food.remove("Йогурт");
        System.out.println("Сейчас в холодильнике " + food.size() + " продуктов.");
        boolean hasPeache = food.containsKey("Персик");
        System.out.println("А у нас есть персик? 🤔 Ответ: " + hasPeache + " 🥳.");


        boolean hasCoconuts = food.containsKey("Кокос");
        System.out.println("А у нас есть кокосы? 🤔 Ответ: " + hasCoconuts + " 😱. Срочно вызываем кокосовый отряд!");

        // А сколько килокалорий в пицце? 🤓 Давайте проверим ...
        int caloriesInPizza = food.get("Пицца");
        System.out.println("Пицца содержит " + caloriesInPizza + " килокалорий на 100 г.");
        // Хм, а сколько продуктов в холодильнике? 🧐 Сейчас посмотрим ...
        System.out.println("Сейчас в холодильнике " + food.size() + " продуктов.");

        // А не съесть ли яблоко? 🍏
        food.remove("Яблоки");
        System.out.println("Сейчас в холодильнике " + food.size() + " продукта. Кажется, пора пополнить запасы! 🛒");

        // Выведем содержимое холодильника в консоль:
        for (Map.Entry<String, Integer> entry : food.entrySet()) {
            System.out.println("'" + entry.getKey() + "' содержит " + entry.getValue() + " килокалорий в 100 г.");
        }

        // Когда в холодильнике пусто ...
        System.out.println("Сейчас в холодильнике " + food.size() + " продуктов.");

        if (food.isEmpty()) {
            System.out.println("Ничего не осталось! 😯 Срочно заказываем доставку! 🛍");
        } else {
            System.out.println("Всё в порядке! 😎");
        }
    }
}
